const cardsData = [
  {
    id: "card1",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card2",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card3",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card4",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card5",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card6",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card7",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card8",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
  {
    id: "card9",
    name: "الطب العام",
    description: "احجز موعدك مع أفضل الأطباء في مختلف التخخصات خلال دقائق",
  },
];

export default cardsData;
