const useAllSpecialities = () => {
  return [
    {
      id: "0ab4482f-ceb6-4939-9cc0-39c0a4a16b6f",
      name: "الصحة النفسية",
      description:
        "يقدم قسم الصحة النفسية في مستشفى الملك فيصل رعاية نفسية متخصصة، مع التركيز على مرضى زراعة الأعضاء.",
      insuranceCode: "",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "a99f885e-3362-4827-acdd-6d8737bc8876",
      name: "الطب الباطني",
      description:
        "يعد قسم الطب الباطني، الذي يضم ثمانية تخصصات فرعية وبرنامجين تدريبيين، من بين أكبر أقسام المستشفى. يقدم رعاية شاملة، ويؤكد على الابتكار، ويدير برنامج الوصول إلى الأوعية الدموية.",
      insuranceCode: "TC008",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "6545df11-6913-4251-a271-13d30d8a8ed5",
      name: "المعالجة الإشعاعية",
      description:
        "يقدم أفضل مركز للعلاج الإشعاعي في الخليج علاجات متخصصة لمختلف أنواع السرطان مع تقليل الآثار الجانبية. نحن معتمدون من قبل منظمة الصحة العالمية واللجنة الدولية للطاقة الذرية.",
      insuranceCode: "TC007",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "051a205e-6ae8-475a-abfd-cbe8fc5d9435",
      name: "أمراض الدم و الأورام لدى الأطفال",
      description:
        "يقدم قسم أمراض الدم / الأورام لدى الأطفال ، وهو أحد أكبر الأقسام في المنطقة ، رعاية متخصصة للأطفال المصابين بالسرطان واضطرابات الدم. مع 350 حالة سرطان جديدة سنويا وإجراء 135 عملية زرع خلايا جذعية.",
      insuranceCode: "TC001",
      _count: {
        doctors: 2,
      },
    },
    {
      id: "036bd8c5-bbde-4fca-929f-1f7936643d0a",
      name: "برنامج زراعة الأمعاء",
      description:
        "يقود مركز الملك فيصل التخصصي ومركز الأبحاث في المملكة العربية السعودية برنامجا رائدا لزراعة الأمعاء ، رائدا من قبل متخصصين خبراء..",
      insuranceCode: "TC006",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "8b99544e-2ba3-4605-9ff4-e6df4f79989a",
      name: "برنامج زراعة البنكرياس",
      description:
        "زرع الكلى والبنكرياس هو العلاج الأفضل لمرضى السكري من النوع 1 الذين يعانون من مرض الكلى الحاد ، مما يوفر نوعية حياة وبقاء أفضل من غسيل الكلى.",
      insuranceCode: "TC009",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "2d4187b7-2aa5-4825-b49f-fd372ef9518c",
      name: "برنامج زراعة الرئة",
      description:
        "يُعدُّ برنامج مستشفى الملك فيصل التخصصي ومركز الأبحاث لزراعة الرئة من أفضل البرامج التي يقودها أخصائيون ذوو خبرة عالية يحرصون على تقديم الرعاية الفائقة المطلوبة لعلاج المرضى لزراعة الرئة في المملكة العربية السعودية.",
      insuranceCode: "TC016",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "fc1b692f-734d-455f-ae19-89170db0a803",
      name: "برنامج زراعة الكبد",
      description:
        "يفتخر مركز الملك فيصل التخصصي والأبحاث في المملكة العربية السعودية ببرنامج زراعة الكبد الأفضل. سنويا ، يقومون بتقييم 300 مريض ، ويكملون ما يصل إلى 150 عملية زرع ناجحة. توفر عيادتهم رعاية شاملة ومبتكرة للمتبرعين والمتلقين.",
      insuranceCode: "TC021",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "197fa429-1026-44f8-a08b-fddab138a3b2",
      name: "برنامج زراعة الكلى",
      description:
        "يمتلك مركز الملك فيصل التخصصي والأبحاث في المملكة العربية السعودية برنامجا رائدا لزراعة الكلى ، حيث يشرف المتخصصون الخبراء على 200 عملية زرع ناجحة سنويا من 500 مريض تم تقييمهم.",
      insuranceCode: "TC022",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "5e7e5442-14f2-4c96-8494-a3cb7c92cc9b",
      name: "بنك العظام",
      description:
        "يضم مستشفى الملك فيصل التخصصي ومركز الأبحاث أول بنك عظام رسمي في الشرق الأوسط. داخل قسم جراحة العظام ، يقوم بنك العظام باسترداد وإعادة بناء العظام والأنسجة البشرية المتبرع بها من متبرعين متعددي الأعضاء المصرح لهم ، مما يضمن الحفاظ على شكل الجسم.",
      insuranceCode: "TC019",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "3d2fb464-4f74-4bc2-87d9-a3a30489fe85",
      name: "جراحة العظام",
      description:
        "يقدم قسم جراحة العظام رعاية متقدمة ، بما في ذلك علاجات العظام المتخصصة والإجراءات طفيفة التوغل ، مع أكثر من 200 عملية زرع عظام سنويا واعتمادات دولية.",
      insuranceCode: "TC020",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "abe4a952-c8f8-423b-ad46-490e8fef5299",
      name: "طب الأسنان",
      description:
        "يقدم قسم طب الأسنان في مستشفى الملك فيصل خدمات طب الأسنان الشاملة للمقيمين والموظفين، إنهم يديرون عيادات الطوارئ ويتعاونون مع الفرق الطبية المتخصصة.",
      insuranceCode: "TC003",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "c083bbb3-3360-49dd-a7b8-56950d61c3a7",
      name: "طب الأطفال",
      description:
        "يوفر قسم طب الأطفال رعاية صحية متخصصة للأطفال عبر مجالات مثل الحساسية وحديثي الولادة. مع التركيز على البحث والتعليم ، قدمنا عيادة افتراضية.",
      insuranceCode: "TC004",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "8376cb86-4bf4-49c4-b834-f5b4feceacab",
      name: "طب الرعاية الحرجة",
      description:
        "يدير طب الرعاية الحرجة في مستشفى الملك فيصل التخصصي ومركز الأبحاث وحدات تضم 76 سريرًا لتلبية الاحتياجات المتنوعة ، ويقبل 4,000+ مريض سنويًا. يقدم رعاية متقدمة 24/7 مع فريق متخصص ولديهم فريق استجابة سريعة لحالات الطوارئ.",
      insuranceCode: "TC015",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "8719cf71-0805-4148-8d29-b2a2c4ec0614",
      name: "طب العائلة والعيادات الشاملة",
      description:
        "يساعد قسم العيادات قسم الطوارئ في التقييمات الأولية للمرضى ويقدم رعاية عاجلة شخصية وافتراضية. تتوفر عيادات مسائية وافتراضية فقط ، ويقوم أطباء الأسرة بإجراء إجراءات بسيطة.",
      insuranceCode: "TC017",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "ea07f4c6-2d21-4fed-b568-9a38817fa083",
      name: "علم الأمراض والطب المخبري",
      description:
        "أجرى قسم علم الأمراض والطب المخبري 24 مليون اختبار في عام 2021 ويعمل 24/7. كثاني أكبر وحدة ، لدينا 400+ موظف من أصول عالمية ونقدم التدريب على الرعاية الصحية.",
      insuranceCode: "TC005",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "5a45f676-0624-4214-b5f4-07acc7ca8c9e",
      name: "قسم الأذن والأنف والحنجرة، جراحة الرأس والعنق و علوم التواصل",
      description:
        "يقدم قسم الأنف والأذن والحنجرة في المملكة العربية السعودية رعاية رائدة في أمراض الأنف والأذن والحنجرة. مشهورون في المملكة ، نحن نتفوق في علاجات سرطان الرأس والرقبة. يدير مجلس الأورام لدينا منذ عام 1980، 213 حالة ورم جديدة سنويا.",
      insuranceCode: "TC002",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "aa75f4fb-f556-4ba7-bec5-d2d42b539b48",
      name: "قسم التخدير",
      description:
        "يضم قسم التخدير لدينا ثمانية أقسام متخصصة ويتعامل مع أكثر من 15000 عملية جراحية سنويا. كما نخدم غرف الولادة والأشعة والعلاج الإشعاعي ووحدات المناظير. مع نحو 40 طبيب تخدير مقيمًا واستشاريًّا دوليًّا، نضمن رعاية من الدرجة الأولى في الفترة المحيطة بالجراحة للمرضى.",
      insuranceCode: "TC011",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "35084583-949d-46c1-bda4-dec13c4af5ae",
      name: "قسم الجراحة",
      description:
        "يتعامل قسم الجراحة لدينا ، مع الجراحين الخبراء ، مع 5000 حالة متنوعة سنويا ، مما يؤدي إلى مجالات مثل الجراحة بالمنظار وتحديد مراحل سرطان الثدي.",
      insuranceCode: "TC013",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "c88cbdf6-1b89-47ec-b39e-845e96325a60",
      name: "قسم الجلدية",
      description:
        "يقدم قسم الأمراض الجلدية في منشأتنا رعاية متقدمة ، متخصصة في مشاكل الجلد المتعلقة بزراعة الأعضاء ، والأورام ، والعلاجات البيولوجية ، والوقاية من الأورام ، من بين خدمات أخرى.",
      insuranceCode: "TC014",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "9883c62e-3b22-49b7-8b30-b827d1a4e3aa",
      name: "قسم الطوارئ",
      description:
        "يخدم قسم طب الطوارئ لدينا ، أول مركز معتمد لآلام الصدر في المملكة العربية السعودية ، 75000 مريض سنويا. مع أقسام البالغين والأطفال والرعاية العاجلة والإسعاف ، نقدم رعاية متخصصة 24/7 وتوجيه المرضى لمزيد من العلاج.",
      insuranceCode: "TC018",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "980f8cbe-c5a0-4c3b-8c17-7ff629c2ea9f",
      name: "قسم المسالك البولية",
      description:
        "يعالج قسم المسالك البولية اضطرابات المسالك البولية ، التي تمتد من السرطانات إلى الجراحة الروبوتية، يتخصص جراحونا الخبراء في الإجراءات الترميمية ونحن مرتبطون بجامعة الفيصل.",
      insuranceCode: "TC010",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "74d825d4-de8b-46bb-85e4-7a7f4dd2d49a",
      name: "قسم النساء والولادة",
      description:
        "يقدم قسم أمراض النساء والولادة في مستشفى الملك فيصل الرعاية المتقدمة للأم والجنين، وعلاجات العقم، ويتخصص في أمراض الأورام النسائية وأمراض المسالك البولية النسائية. تشمل خبرتنا الحالات عالية الخطورة والتقنيات الإنجابية المبتكرة.",
      insuranceCode: "TC023",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "1a240d46-9776-4cc6-be95-28b731d82143",
      name: "مركز التوحد",
      description:
        "تأسس مركز أبحاث التوحد (CFAR) من خلال منحة مقدمة من الشركة السعودية للصناعات الأساسية (سابك) في عام 2010، وذلك بغرض إنشاء مركز متميز في أبحاث التوحد داخل مستشفى الملك فيصل التخصصي ومركز الأبحاث.",
      insuranceCode: "TC012",
      _count: {
        doctors: 0,
      },
    },
  ];
};
export default useAllSpecialities;
