const useLandingPageRecords = () => {
  return [
    {
      id: "0ab4482f-ceb6-4939-9cc0-39c0a4a16b6f",
      name: "الصحة النفسية",
      description:
        "يقدم قسم الصحة النفسية في مستشفى الملك فيصل رعاية نفسية متخصصة، مع التركيز على مرضى زراعة الأعضاء.",
      insuranceCode: "",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "a99f885e-3362-4827-acdd-6d8737bc8876",
      name: "الطب الباطني",
      description:
        "يعد قسم الطب الباطني، الذي يضم ثمانية تخصصات فرعية وبرنامجين تدريبيين، من بين أكبر أقسام المستشفى. يقدم رعاية شاملة، ويؤكد على الابتكار، ويدير برنامج الوصول إلى الأوعية الدموية.",
      insuranceCode: "TC008",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "6545df11-6913-4251-a271-13d30d8a8ed5",
      name: "المعالجة الإشعاعية",
      description:
        "يقدم أفضل مركز للعلاج الإشعاعي في الخليج علاجات متخصصة لمختلف أنواع السرطان مع تقليل الآثار الجانبية. نحن معتمدون من قبل منظمة الصحة العالمية واللجنة الدولية للطاقة الذرية.",
      insuranceCode: "TC007",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "051a205e-6ae8-475a-abfd-cbe8fc5d9435",
      name: "أمراض الدم و الأورام لدى الأطفال",
      description:
        "يقدم قسم أمراض الدم / الأورام لدى الأطفال ، وهو أحد أكبر الأقسام في المنطقة ، رعاية متخصصة للأطفال المصابين بالسرطان واضطرابات الدم. مع 350 حالة سرطان جديدة سنويا وإجراء 135 عملية زرع خلايا جذعية.",
      insuranceCode: "TC001",
      _count: {
        doctors: 2,
      },
    },
    {
      id: "036bd8c5-bbde-4fca-929f-1f7936643d0a",
      name: "برنامج زراعة الأمعاء",
      description:
        "يقود مركز الملك فيصل التخصصي ومركز الأبحاث في المملكة العربية السعودية برنامجا رائدا لزراعة الأمعاء ، رائدا من قبل متخصصين خبراء..",
      insuranceCode: "TC006",
      _count: {
        doctors: 0,
      },
    },
    {
      id: "8b99544e-2ba3-4605-9ff4-e6df4f79989a",
      name: "برنامج زراعة البنكرياس",
      description:
        "زرع الكلى والبنكرياس هو العلاج الأفضل لمرضى السكري من النوع 1 الذين يعانون من مرض الكلى الحاد ، مما يوفر نوعية حياة وبقاء أفضل من غسيل الكلى.",
      insuranceCode: "TC009",
      _count: {
        doctors: 0,
      },
    },
  ];
};
export default useLandingPageRecords;
